SunCity/src/Documents/АктПриемаПередачиИСМПТК/АктПриемаПередачиИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемаПередачиИСМПТК</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеАктПриемаПередачиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИСМПТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВИСМПТ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ХозяйственныеОперацииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАкта</name>
    <type>
      <types>EnumRef.ВидыДокументаИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвязанныйАкт</name>
    <comment>Первичный Акт для исправляемого АПП</comment>
    <type>
      <types>DocumentRef.АктПриемаПередачиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерСвязанногоАкта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>42</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУведомлениеОРасхождении</name>
    <type>
      <types>DocumentRef.УведомлениеОРасхожденииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>DefinedType.ПоставщикПолучательИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ПоставщикПолучательИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегНомерНаБумажномНосителе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпискиНаБумажномНосителе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.ПользователиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>EnumRef.ВидыПродукцииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапОформления</name>
    <type>
      <types>EnumRef.ЭтапыОформленияДокументовИСЦЭДМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУведОРасхождениях</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАППИсправленный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАПППервичный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсточник</name>
      <comment>Количество потребительских упаковок в GTIN</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>DefinedType.ЕдиницаИзмеренияИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатурыИСМПТК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУпаковки</name>
      <type>
        <types>EnumRef.ВидыУпаковокИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество потребительских упаковок</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсточник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодИдентификации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTINВерхнегоУровня</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расхождения</name>
    <comment>(проверка содержимого во входящих документах)</comment>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУпаковки</name>
      <type>
        <types>EnumRef.ВидыУпаковокИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество потребительских упаковок</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодИдентификации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСверкиКода</name>
      <type>
        <types>EnumRef.СтатусыСверкиКодаИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTINВерхнегоУровня</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Итоги</name>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатурыИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>DefinedType.СтавкаНДСИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДСЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/Enums/НаправленияДокументовИСМПТК/НаправленияДокументовИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияДокументовИСМПТК</name>
  <enumValues>
    <name>Входящий</name>
  </enumValues>
  <enumValues>
    <name>Исходящий</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Documents/АктПриемаПередачиИСМПТК/Forms/ФормаСпискаДокументов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СписокНаправленийАктов.Добавить(Перечисления.НаправленияДокументовИСМПТК.Входящий,  НСтр("ru = 'Акты приема/передачи (входящие) (ИС МПТ)'"));
	СписокНаправленийАктов.Добавить(Перечисления.НаправленияДокументовИСМПТК.Исходящий, НСтр("ru = 'Акты приема/передачи (исходящие) (ИС МПТ)'"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", 		 Параметры.ВыборГруппИЭлементов);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", 			 Параметры.ЗакрыватьПриВыборе);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Параметры.ЗакрыватьПриЗакрытииВладельца);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", 	 Параметры.КлючНазначенияИспользования);
	ПараметрыФормы.Вставить("МножественныйВыбор", 			 Параметры.МножественныйВыбор);
	ПараметрыФормы.Вставить("Отбор", 						 Параметры.Отбор);
	ПараметрыФормы.Вставить("ПараметрыФункциональныхОпций",  Параметры.ПараметрыФункциональныхОпций);
	ПараметрыФормы.Вставить("РазрешитьВыборКорня", 			 Параметры.РазрешитьВыборКорня);
	ПараметрыФормы.Вставить("РежимВыбора", 					 Параметры.РежимВыбора);
	ПараметрыФормы.Вставить("ТекущаяСтрока",				 Параметры.ТекущаяСтрока);
	ПараметрыФормы.Вставить("ТолькоПросмотр",				 Параметры.ТолькоПросмотр);
	ПараметрыФормы.Вставить("ФиксированныеНастройки",		 Параметры.ФиксированныеНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СобытияФормИСМПТККлиентПереопределяемый.ПриОткрытии(ЭтаФорма, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ

&НаКлиенте
Процедура СписокНаправленийАктовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = СписокНаправленийАктов.НайтиПоИдентификатору(ВыбраннаяСтрока);	
	ОткрытьСписокАктов(СтрокаТаблицы.Значение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьСписок(Команда)
	
	СтрокаТаблицы = Элементы.СписокНаправленийАктов.ТекущиеДанные;
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		ОткрытьСписокАктов(СтрокаТаблицы.Значение);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОткрытьСписокАктов(НаправлениеАкт)
	
	Если НаправлениеАкт = ПредопределенноеЗначение("Перечисление.НаправленияДокументовИСМПТК.Входящий") Тогда
		ОткрытьФорму("Документ.АктПриемаПередачиИСМПТК.Форма.ФормаСпискаВходящих", ПараметрыФормы);
	Иначе
		ОткрытьФорму("Документ.АктПриемаПередачиИСМПТК.Форма.ФормаСпискаИсходящих", ПараметрыФормы);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры
